#+TITLE: Advent of Code 2024
#+SUBTITLE: Day 4: Ceres Search
#+AUTHOR: Michael R. Mauger
#+DATE: [Wed Dec  4 19:53:40 EST 2024]
#+STARTUP: showeverything inlineimages
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
#+OPTIONS: num:nil

#+AUTO_TANGLE: t
#+PROPERTY: header-args    :tangle no
#+PROPERTY: header-args    :noweb no-export

* Execution

#+BEGIN_SRC bash :results output
  guile3.0 --no-auto-compile --r7rs ceres-search.scm example.dat
  guile3.0 --no-auto-compile --r7rs ceres-search.scm input.dat
#+END_SRC

#+RESULTS:
: Part One: Ceres Search XMAS in "example.dat": 18
: Part Two: Ceres Search X-MAS in "example.dat": 9
: Part One: Ceres Search XMAS in "input.dat": 2618
: Part Two: Ceres Search X-MAS in "input.dat": 2011
